src/DataProcessors/ПЭДО_ПлатформаЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ПЭДО_ПлатформаЭДО</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭтоТестоваяОбработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Организации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/ПЭДО_ПлатформаЭДО/Forms/ФормаШаблонаПакета/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Организация") тогда	
		ЭтотОбъект.Организация = Параметры.Организация;
	КонецЕсли;
	
	Если Параметры.Свойство("Контрагент") тогда	
		ЭтотОбъект.Контрагент = Параметры.Контрагент;
	КонецЕсли;
   
	Если Параметры.Свойство("ЭтоНовый") тогда
		ЭтотОбъект.ЭтоНовый = Параметры.ЭтоНовый;
	КонецЕсли;
	
	Если Параметры.Свойство("ЭтоМассовоеСоздание") тогда
		ЭтаФорма.Элементы.ГруппаОсновноеОкно.Видимость = Ложь;
		ЭтаФорма.Элементы.ГруппаМассовоеСоздание.Видимость = Истина;
		ЭтотОбъект.ЭтоМассовоеСоздание = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("ЭтоКопирование" )тогда
		ЭтотОбъект.ЭтоКопирование = Параметры.ЭтоКопирование;
	КонецЕсли;
	
	Если НЕ Параметры.ЭтоНовый тогда
		
		ЭтотОбъект.Наименование = Параметры.Наименование;
	
		Настройка = ХранилищеОбщихНастроек.Загрузить("ОФД_ЭДО_НастройкиОбработки",
		ЭтотОбъект.Наименование,
		"Содержит шаблоны пакетов ЭД",
		ПолучитьТекущегоПользователя());
		
		ТаблицаТиповДокументов.Загрузить(Настройка.ТаблицаНастроекПоиска);
		
		Если ЭтотОбъект.ЭтоКопирование тогда
			ЭтотОбъект.Наименование = "";
		КонецЕсли;
		
	ИначеЕсли Параметры.ЭтоНовый тогда	
		
		//ЭтотОбъект.Элементы.Контрагент.ТолькоПросмотр = Ложь;
		
	КонецЕсли;
	
	ЗаполнитьРазрешенныеТипыИзНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Параметры.Свойство("ЭтоМассовоеСоздание") тогда
		Если Параметры.ЭтоМассовоеСоздание = Истина тогда
			ЭтаФорма.Элементы.ГруппаОсновноеОкно.Видимость = Ложь;
			ЭтаФорма.Элементы.ГруппаМассовоеСоздание.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
		
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеНажатие(Элемент)
	ЭтаФорма.Элементы.Описание.Видимость = Ложь;
	ЭтаФорма.Элементы.СвернутоеОписание.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СвернутоеОписаниеНажатие(Элемент)
	ЭтаФорма.Элементы.СвернутоеОписание.Видимость = Ложь;
	ЭтаФорма.Элементы.Описание.Видимость = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормы

&НаКлиенте
Процедура ТаблицаТиповДокументовТипСвязанногоДокументаПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	 ПараметрыПоиска = Новый Структура;
	 ПараметрыПоиска.Вставить("ДокРодитель", ЭтаФорма.Элементы.ТаблицаТиповДокументов.ТекущиеДанные.ТипДокумента);
	
	 МассивТипов = ПолучитьМассивРазрешенныхТипов(ПараметрыПоиска, Истина);
	 
	 ЭтаФорма.Элементы.ТаблицаТиповДокументовТипСвязанногоДокументаПредставление.СписокВыбора.Очистить();
	 
	 Для каждого Тип из МассивТипов цикл
		 
		 ЭтаФорма.Элементы.ТаблицаТиповДокументовТипСвязанногоДокументаПредставление.СписокВыбора.Добавить(Тип.Значение, Тип.Представление);		 
		 
	 КонецЦикла;
	
КонецПроцедуры  

&НаКлиенте
Процедура ТаблицаТиповДокументовТипДокументаПредставлениеПриИзменении(Элемент)

	Элементы.ТаблицаТиповДокументов.ТекущиеДанные.ТипДокумента = Элементы.ТаблицаТиповДокументов.ТекущиеДанные.ТипДокументаПредставление;
	ПФЗначение = Элементы.ТаблицаТиповДокументов.ТекущиеДанные.ТипДокумента;
    ЭлементСписка = Элементы.ТаблицаТиповДокументовТипДокументаПредставление.СписокВыбора.НайтиПоЗначению(ПФЗначение);
	Элементы.ТаблицаТиповДокументов.ТекущиеДанные.ТипДокументаПредставление = ЭлементСписка.Представление;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТиповДокументовТипДокументаДобавлениеМножественныхЗначений(Элемент, Значения, СтандартнаяОбработка)
	Отказ = Истина;
	Возврат
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТиповДокументовТипДокументаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)

	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	
	//Элемент.ДоступныеТипы = Новый ОписаниеТипов(МассивТипов);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТиповДокументовПриАктивизацииСтроки(Элемент)
	
КонецПроцедуры

#Область ОбработчикиВыбораПФ

&НаСервере
Функция ПолучитьКомандыПечатиПоОбъекту(Метаданные) Экспорт

	мДанные = Новый Массив;	
	мДанные.Добавить(Метаданные);
	
	НайденныеКомандыПечати = УправлениеПечатью.КомандыПечатиФормы("ФормаЭлемента", мДанные);
	
	Возврат НайденныеКомандыПечати;

КонецФункции

&НаСервере
Функция УказаннаяФормаВПФСоответствуетДокументу(ВПФ, ЭкземплярДокумента)
	
	УказаннаяФормаСоответствуетДокументу = Ложь;
	Для Каждого Назначение из ВПФ.Назначение Цикл
		Если Назначение.ОбъектНазначения.Имя = ЭкземплярДокумента.Метаданные().Имя Тогда
			УказаннаяФормаСоответствуетДокументу = Истина;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	Возврат УказаннаяФормаСоответствуетДокументу;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции  

&НаСервере
Функция ПолучитьДоступныеОрганизации1С()
	
	ЗапросОрганизаций = Новый Запрос;
	ЗапросОрганизаций.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка,
	|	Организации.ПометкаУдаления,
	|	Организации.Предопределенный,
	|	Организации.ИНН,
	|	Организации.КПП
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.ПометкаУдаления = ЛОЖЬ";
	
	Результат = ЗапросОрганизаций.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Результат = Результат.Выбрать();
		МассивОрганизаций = Новый Массив;
		Пока Результат.Следующий() Цикл
			ДанныеПоОрганизации = Новый Структура;
			ДанныеПоОрганизации.Вставить("Ссылка", Результат.Ссылка);
			ДанныеПоОрганизации.Вставить("ИНН", Результат.ИНН);
			ДанныеПоОрганизации.Вставить("КПП", Результат.КПП);
			МассивОрганизаций.Добавить(ДанныеПоОрганизации);	
		КонецЦикла;
		Возврат МассивОрганизаций; 
	Иначе	
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции	

// Функция загрузки Кэш
// Если значение реквизита формы "АдресВременногоХранилищаКэш" заполнено, то берем Кэш из временного хранилища (ШтатныйЗапуск())
&НаСервере
Функция ЗагрузитьКэш(Откат = Ложь)       
	
	Если ЗначениеЗаполнено(ЭтаФорма.АдресВременногоХранилищаКэш) и Не Откат Тогда
		
		Кэш = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресВременногоХранилищаКэш);
		
		Если НЕ ЗначениеЗаполнено(Кэш) Тогда
			МодульОбъектаОбработки = РеквизитФормыВЗначение("Объект");
			Кэш = МодульОбъектаОбработки.Инициализация(Откат);
			ЗначениеВРеквизитФормы(МодульОбъектаОбработки, "Объект");
		КонецЕсли;	
		
		Возврат Кэш;
		
	Иначе
		
		МодульОбъектаОбработки = РеквизитФормыВЗначение("Объект");
		Кэш = МодульОбъектаОбработки.Инициализация(Откат);
		ЗначениеВРеквизитФормы(МодульОбъектаОбработки, "Объект"); 
		
		Возврат Кэш;
		
	КонецЕсли;
	
КонецФункции

// Функция сохранения Кэш в процессе работы
// В текущий Кэш записываем только требуемые для выгрузки настройки, остальные динамически подргружаем по мере необходимости
&НаСервере
Процедура СохранитьКэш(Кэш)
	
	// Удаляем предыдущее значение Кэш из временного хранилища
	Если ЗначениеЗаполнено(ЭтаФорма.АдресВременногоХранилищаКэш) Тогда
		//УдалитьИзВременногоХранилища(ЭтаФорма.АдресВременногоХранилищаКэш);
		Адрес = ЭтаФорма.АдресВременногоХранилищаКэш;
	Иначе
		Адрес = ЭтаФорма.УникальныйИдентификатор;
	КонецЕсли;
	
	// Записываем новое значение Кэш во временное хранилище
	ЭтаФорма.АдресВременногоХранилищаКэш = ПоместитьВоВременноеХранилище(Кэш, Адрес);	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИмяОбъектаМетаданных(Тип)
	
	Возврат Метаданные.НайтиПоТипу(Тип).Имя;	
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОбъектМетаданных(Тип)
	
	Возврат Метаданные.НайтиПоТипу(Тип);	
	
КонецФункции

&НаСервере
Процедура ЗаполнитьРазрешенныеТипыИзНастройки()
	
	РеестрДокументов = "Конфигурация";
	
	// Получаем данные из настроек и обновляем Кэш
	Кэш = ЗагрузитьКэш();
	
	Если НЕ Кэш = Неопределено Тогда	
		
		МодульОбъектаОбработки = РеквизитФормыВЗначение("Объект");
		Настройка = МодульОбъектаОбработки.ПолучитьОбъектНастройкиПоИмениМетаданных(РеестрДокументов, Кэш);
		
		Если НЕ Настройка.СпискиДокументов.Свойства().Получить("СписокДокументов") = Неопределено Тогда
			
			
			Если ТипЗнч(Настройка.СпискиДокументов.СписокДокументов) = Тип("СписокXDTO") Тогда
				// Несколько списков документов
				СписокДокументов = Настройка.СпискиДокументов.ПолучитьСписок("СписокДокументов");
			Иначе
				// Один список документов
				СписокДокументов = Новый Массив;
				СписокДокументов.Добавить(Настройка.СпискиДокументов.СписокДокументов);
			КонецЕсли; 
			
			СписокТипов = Новый СписокЗначений;
			
			Для каждого Список из СписокДокументов цикл
				
				СписокТипов.Добавить(Тип("ДокументСсылка." + Список.ОсновнаяТаблица), Список.ОсновнаяТаблица);
               
			КонецЦикла;
				
			ЭтотОбъект.ДоступныеТипыДокументов = СписокТипов;
			
			Для Каждого Список из СписокДокументов Цикл
				
				// Распаковываем список доступных форматов для списка документов в Кэш
				Если ТипЗнч(Список.ФорматыДляВыгрузки.Формат) = Тип("СписокXDTO") Тогда
					// Несколько форматов
					СписокДоступныхФорматов = Список.ФорматыДляВыгрузки.ПолучитьСписок("Формат");
				Иначе
					// Один формат
					СписокДоступныхФорматов = Новый Массив;
					СписокДоступныхФорматов.Добавить(Список.ФорматыДляВыгрузки.Формат);
				КонецЕсли; 		
				
				СписокЗначений = Новый СписокЗначений;
				Индекс = 0;
				Для Каждого Формат из СписокДоступныхФорматов Цикл			
					СписокЗначений.Вставить(Индекс, Формат.Значение, Формат.Представление);
					Индекс = Индекс + 1; 
				КонецЦикла;
				Кэш.ДоступныеФорматы.Вставить(Список.Наименование, СписокЗначений)
				
			КонецЦикла
		КонецЕсли;
	КонецЕсли;
	
	СохранитьКэш(Кэш);
	
	СпискиДокументов = ЭтотОбъект.ДоступныеТипыДокументов;
	СписокДокументов = Новый Массив; 
		
	Для Каждого Список из СпискиДокументов цикл
			
		ЭтаФорма.Элементы.ТаблицаТиповДокументовТипДокументаПредставление.СписокВыбора.Добавить("ДокументСсылка." + Список.Представление, Список.Значение); 
		
		Если ЭтотОбъект.ЭтоМассовоеСоздание тогда
			ЭтаФорма.Элементы.ТаблицаТиповДокументовМассовоеСозданиеТипДокументаПредставление.СписокВыбора.Добавить("ДокументСсылка." + Список.Представление, Список.Значение);
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивРазрешенныхТипов(ДанныеВыбора, ЭтоСвязанныйДокумент)
	
	СписокДокументов = Новый Массив;
	
	Если Не ЭтоСвязанныйДокумент тогда
		//Основной документ пакета
		СпискиДокументов = ЭтотОбъект.ДоступныеТипыДокументов;
		СписокДокументов = Новый Массив; 
		
		Для Каждого Список из СпискиДокументов цикл
			
			СписокДокументов.Добавить(Тип("ДокументСсылка." + Список.Представление));
			
		КонецЦикла;
		
	Иначе
		//Связанный документ
		
		СписокДокументов = Новый СписокЗначений;
		
		Для Каждого Элемент Из Метаданные.КритерииОтбора.СвязанныеДокументы.Состав Цикл
			Если Элемент.Тип.СодержитТип(Тип(ДанныеВыбора.ДокРодитель)) Тогда
				
				ПолноеИмя = Элемент.ПолноеИмя();
				МДанные = Метаданные.НайтиПоПолномуИмени(ПолноеИмя);
				
				Если СтрНайти(ПолноеИмя, "Справочник") <> 0  тогда
					Продолжить
				КонецЕсли;
				
				Если СтрНайти(ПолноеИмя, "ТабличнаяЧасть") <> 0 тогда
					СписокДокументов.Добавить("ДокументСсылка." + Элемент.Родитель().Родитель().Имя, Элемент.Родитель().Родитель().Синоним);
				Иначе
					СписокДокументов.Добавить("ДокументСсылка." + Элемент.Родитель().Имя, Элемент.Родитель().Синоним);
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		
	КонецЕсли;
	
	Возврат СписокДокументов;
	
КонецФункции

#Область СохранениеНастроек

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	СохранитьИзмененияНаСервере();
	ЭтотОбъект.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзменения(Команда)
	
	СохранитьИзмененияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьИзмененияНаСервере()
	
Если НЕ ЭтотОбъект.ЭтоМассовоеСоздание тогда
	Если ЭтотОбъект.ЭтоНовый тогда;
		Если НЕ НаименованиеУникально() тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Наименование уже используется.";
			Сообщение.Сообщить();
			Возврат
		КонецЕсли;	
	КонецЕсли;
	
	//Проверка заполненности 
	СтруктураДанных = ПолучитьСтруктуруДанныхФормы(); 
	//Если СтруктураДанных.Наименование = "" ИЛИ
	//	НЕ ЗначениеЗаполнено(СтруктураДанных.Организация) ИЛИ
	//	НЕ ЗначениеЗаполнено(СтруктураДанных.Контрагент) ИЛИ
	
	
	ХранилищеОбщихНастроек.Сохранить("ОФД_ЭДО_НастройкиОбработки",
	ЭтотОбъект.Наименование,
	СтруктураДанных,
	"Содержит шаблоны пакетов ЭД",
	ПолучитьТекущегоПользователя());
	ПроверитьИЗаполнитьСвязанныеРеквизиты();
	Если ЭтотОбъект.ЭтоНовый = Истина ИЛИ НаименованиеИзменено() = Истина тогда
		
		ВсеНастройки = ХранилищеОбщихНастроек.Загрузить("ОФД_ЭДО_НастройкиОбработки",
		"СписокШаблоновПакетов",
		"Содержит список шаблонов пакетов ЭД",
		ПолучитьТекущегоПользователя());
		
		//Первое заполнение
		Если ТипЗнч(ВсеНастройки) = Неопределено тогда
			
			ИнициализироватьСписокШаблонов();
			
			ВсеНастройки = ХранилищеОбщихНастроек.Загрузить("ОФД_ЭДО_НастройкиОбработки",
			"СписокШаблоновПакетов",
			"Содержит список шаблонов пакетов ЭД",
			ПолучитьТекущегоПользователя());
			
			
		КонецЕсли;
				
		НСтр = ВсеНастройки.Добавить(); 
		НСтр.Организация = ЭтотОбъект.Организация;
		НСтр.Контрагент = ЭтотОбъект.Контрагент;
		НСтр.Наименование = ЭтотОбъект.Наименование;
		
		ХранилищеОбщихНастроек.Сохранить("ОФД_ЭДО_НастройкиОбработки",
		"СписокШаблоновПакетов",
		ВсеНастройки,
		"Содержит шаблоны пакетов ЭД",
		ПолучитьТекущегоПользователя()); 
		
	КонецЕсли
Иначе
	
	ОбработатьМассовоеСозданиеШаблонов()
	
КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьМассовоеСозданиеШаблонов()

	ТаблицаОрганизаций = ЭтотОбъект.ВыбранныеОрганизации.Выгрузить();
	ТаблицаКонтрагентов = ЭтотОбъект.ВыбранныеКонтрагенты.Выгрузить();
	
	Для каждого Строка из ТаблицаКонтрагентов цикл
		Если НЕ ЗначениеЗаполнено(Строка.Контрагент) тогда
			ТаблицаКонтрагентов.Удалить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Строка из ТаблицаОрганизаций цикл
		 Если НЕ ЗначениеЗаполнено(Строка.Организация) тогда
			ТаблицаОрганизаций.Удалить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	ВсеНастройки = ХранилищеОбщихНастроек.Загрузить("ОФД_ЭДО_НастройкиОбработки",
	"СписокШаблоновПакетов",
	"Содержит список шаблонов пакетов ЭД",
	ПолучитьТекущегоПользователя());
	
	Если ТипЗнч(ВсеНастройки) = Неопределено тогда
		
		ИнициализироватьСписокШаблонов();
		
		ВсеНастройки = ХранилищеОбщихНастроек.Загрузить("ОФД_ЭДО_НастройкиОбработки",
		"СписокШаблоновПакетов",
		"Содержит список шаблонов пакетов ЭД",
		ПолучитьТекущегоПользователя());
		
		
	КонецЕсли;
	
	ПроверитьИЗаполнитьСвязанныеРеквизиты();
	
	Для каждого СтрокаОрганизаций из ТаблицаОрганизаций цикл
		Для каждого СтрокаКонтрагентов из ТаблицаКонтрагентов цикл
			
			//Добавляем настройку в общий список
			НСтр = ВсеНастройки.Добавить();
			НСтр.Организация = СтрокаОрганизаций.Организация;
			НСтр.Контрагент = СтрокаКонтрагентов.Контрагент;
			НаименованиеНастройки = Строка(СтрокаКонтрагентов.Контрагент.Наименование) + "_" + 
			Строка(СтрокаОрганизаций.Организация.Наименование) + "_" + Строка(ВсеНастройки.Количество());
			НСтр.Наименование = НаименованиеНастройки;
			
			СтруктураНастройки = ПолучитьСтруктуруДанныхФормы();
			СтруктураНастройки.Наименование = НаименованиеНастройки;
			СтруктураНастройки.Контрагент = СтрокаКонтрагентов.Контрагент;
			
			//Записываем настройку в Хранилище
			ХранилищеОбщихНастроек.Сохранить("ОФД_ЭДО_НастройкиОбработки",
			НаименованиеНастройки,
			СтруктураНастройки,
			"Содержит шаблоны пакетов ЭД",
			ПолучитьТекущегоПользователя());
			
		КонецЦикла;
		
	КонецЦикла;
	
	ХранилищеОбщихНастроек.Сохранить("ОФД_ЭДО_НастройкиОбработки",
	"СписокШаблоновПакетов",
	ВсеНастройки,
	"Содержит шаблоны пакетов ЭД",
	ПолучитьТекущегоПользователя());
	
КонецПроцедуры

Функция НаименованиеУникально()
	
	Рез = Ложь;
	
	ВсеНастройки = ХранилищеОбщихНастроек.Загрузить("ОФД_ЭДО_НастройкиОбработки",
	"СписокШаблоновПакетов",
	"Содержит список шаблонов пакетов ЭД",
	ПолучитьТекущегоПользователя()); 
	
	Если НЕ ТипЗнч(ВсеНастройки) = Тип("ТаблицаЗначений") тогда
		ИнициализироватьСписокШаблонов();
	КонецЕсли;
		
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Наименование", ЭтотОбъект.Наименование);
		
	НайденнаяНастройка = ВсеНастройки.НайтиСтроки(СтруктураПоиска); 
		
	Если ТипЗнч(НайденнаяНастройка) = Тип("Массив")  тогда 
		Если НайденнаяНастройка.Количество() = 0 тогда
		Рез = Истина;
		КонецЕсли
	Иначе
		Рез = Ложь;
	КонецЕсли;
	
	Возврат Рез
	
КонецФункции

Функция НаименованиеИзменено()
	Возврат Ложь;	
КонецФункции
	
Процедура ИнициализироватьСписокШаблонов()
		
	ВсеНастройки = Новый ТаблицаЗначений;
	ВсеНастройки.Колонки.Добавить("Организация");
	ВсеНастройки.Колонки.Добавить("Контрагент");
	ВсеНастройки.Колонки.Добавить("Наименование");
		
	ХранилищеОбщихНастроек.Сохранить("ОФД_ЭДО_НастройкиОбработки",
	"СписокШаблоновПакетов",
	ВсеНастройки,
	"Содержит шаблоны пакетов ЭД",
	ПолучитьТекущегоПользователя());
		
КонецПроцедуры
		
Функция ПолучитьСтруктуруДанныхФормы()
		
	Рез = Новый Структура;
		
	Рез.Вставить("Организация", ЭтотОбъект.Организация);
	Рез.Вставить("Контрагент",  ЭтотОбъект.Контрагент);
	
	Если НЕ ЭтотОбъект.ЭтоМассовоеСоздание = Истина тогда
		Рез.Вставить("Наименование", ЭтотОбъект.Наименование); 
	Иначе
		Рез.Вставить("Наименование", ); 
	КонецЕсли;
	
		Рез.Вставить("ТаблицаНастроекПоиска", ЭтотОбъект.ТаблицаТиповДокументов.Выгрузить());

	Возврат Рез
		
КонецФункции
	
&НаСервереБезКонтекста
Функция ПолучитьТекущегоПользователя()
	
	Возврат Неопределено;
	
	Если НЕ Метаданные.ОбщиеМодули.Найти("ПользователиИнформационнойБазы") = Неопределено Тогда
		ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	Иначе
		ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;	
	
	Возврат ТекущийПользователь;
	
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура ТаблицаТиповДокументовТипСвязанногоДокументаПредставлениеПриИзменении(Элемент)
	
	Элементы.ТаблицаТиповДокументов.ТекущиеДанные.ТипСвязанногоДокумента = Элементы.ТаблицаТиповДокументов.ТекущиеДанные.ТипСвязанногоДокументаПредставление;
	ПФЗначение = Элементы.ТаблицаТиповДокументов.ТекущиеДанные.ТипСвязанногоДокумента;
    ЭлементСписка = Элементы.ТаблицаТиповДокументовТипСвязанногоДокументаПредставление.СписокВыбора.НайтиПоЗначению(ПФЗначение);
	Элементы.ТаблицаТиповДокументов.ТекущиеДанные.ТипСвязанногоДокументаПредставление = ЭлементСписка.Представление;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТиповДокументовПечатнаяФормаПредставлениеПриИзменении(Элемент)
	
	Элементы.ТаблицаТиповДокументов.ТекущиеДанные.ПечатнаяФорма = Элементы.ТаблицаТиповДокументов.ТекущиеДанные.ПечатнаяФормаПредставление;
	ПФЗначение = Элементы.ТаблицаТиповДокументов.ТекущиеДанные.ПечатнаяФорма;
    ЭлементСписка = Элементы.ТаблицаТиповДокументовПечатнаяФормаПредставление.СписокВыбора.НайтиПоЗначению(ПФЗначение);
	Элементы.ТаблицаТиповДокументов.ТекущиеДанные.ПечатнаяФормаПредставление = ЭлементСписка.Представление;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТиповДокументовПечатнаяФормаПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ПроверитьИЗаполнитьСвязанныеРеквизиты();
	
	КомандыПечати = ПолучитьКомандыПечатиБезКонтекста(Элементы.ТаблицаТиповДокументов.ТекущиеДанные.ТипСвязанногоДокумента);
	
	Элементы.ТаблицаТиповДокументовПечатнаяФормаПредставление.СписокВыбора.Очистить();
	
	Для каждого Строка из КомандыПечати цикл
		Элементы.ТаблицаТиповДокументовПечатнаяФормаПредставление.СписокВыбора.Добавить(Строка.УникальныйИдентификатор, Строка.Представление);
	КонецЦикла;

КонецПроцедуры

Процедура ПроверитьИЗаполнитьСвязанныеРеквизиты()
	
	Для каждого Строка из ТаблицаТиповДокументов цикл
		Если Строка.ТипСвязанногоДокумента = "" И Строка.ТипСвязанногоДокументаПредставление <> "" тогда
			
			Строка.ТипСвязанногоДокумента = Строка.ТипСвязанногоДокументаПредставление;
			
		КонецЕсли;
		
		Если Строка.ПечатнаяФорма = "" И Строка.ПечатнаяФормаПредставление <> 0 тогда
			
			Строка.ПечатнаяФорма = Строка.ПечатнаяФормаПредставление;
			
		КонецЕсли;
		
		Если Строка.ТипДокумента = "" И Строка.ТипДокументаПредставление <> "" тогда

	        Строка.ТипСвязанногоДокумента = Строка.ТипСвязанногоДокументаПредставление;
			
		КонецЕсли;
		
		Если СтрНайти(Строка.ТипСвязанногоДокумента, " ") <> 0 тогда 
			
			КешЗначения = Строка.ТипСвязанногоДокумента;
			Строка.ТипСвязанногоДокумента = Строка.ТипСвязанногоДокументаПредставление;
			Строка.ТипСвязанногоДокументаПредставление = КешЗначения;
			
		КонецЕслИ;
		
		Если СтрНайти(Строка.ТипДокумента, " ") <> 0 тогда
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКомандыПечатиБезКонтекста(ОбъектМетаданных)
	
	Рез = Новый Массив;
	
	ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип(ОбъектМетаданных));
	
	мДанные = Новый Массив;	
	мДанные.Добавить(ОбъектМетаданных);
	
	ОбъектМетаданных = "";
	
	НайденныеКомандыПечати = УправлениеПечатью.КомандыПечатиФормы("ФормаЭлемента", мДанные);		
	
	НайденныеКомандыПечати.Свернуть("Идентификатор,Представление,УникальныйИдентификатор");
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(НайденныеКомандыПечати);

КонецФункции

&НаКлиенте
Процедура ТаблицаТиповДокументовФорматДокументаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Форматы = ПолучитьРазрешенныеФорматы(Элементы.ТаблицаТиповДокументов.ТекущиеДанные.ТипДокумента);
	Элементы.ТаблицаТиповДокументовФорматДокумента.СписокВыбора.Очистить();	
		
	Для каждого Строка из Форматы цикл
		
		Элементы.ТаблицаТиповДокументовФорматДокумента.СписокВыбора.Добавить(Строка.Значение, Строка.Представление);
		
	КонецЦикла;
	
КонецПроцедуры 

Функция ПолучитьРазрешенныеФорматы(ТипДокумента)
	
	Кэш = ЗагрузитьКэш();
	
	СписокФорматов = Кэш.ДоступныеФорматы.Получить(СтрЗаменить(ТипДокумента, "ДокументСсылка.", ""));
	
	Возврат СписокФорматов;
	
КонецФункции

&НаСервере
Функция ИННКППОрганизации(ВыбОрганизация)

	ИНН = ВыбОрганизация.ИНН;
	КПП = ВыбОрганизация.КПП;
	
	Структура = Новый Структура;
	Структура.Вставить("ИНН", ИНН);
	Структура.Вставить("КПП", КПП);
	
 	Возврат Структура 		

КонецФункции  

 &НаСервере
Функция ИННКППКонтрагента(ВыбКонтрагент)

	ИНН = ВыбКонтрагент.ИНН;
	КПП = ВыбКонтрагент.КПП;
	
	Структура = Новый Структура;
	Структура.Вставить("ИНН", ИНН);
	Структура.Вставить("КПП", КПП);
	
 	Возврат Структура 		

КонецФункции  


#КонецОбласти

#Область ОбработчикиМассовогоСоздания

&НаКлиенте
Процедура ВыбранныеОрганизацииОрганизацияПриИзменении(Элемент)
	
	ВыбОрганизация = Элементы.ВыбранныеОрганизации.ТекущиеДанные.Организация;
	СтруктураДанных = ИННКППОрганизации(ВыбОрганизация);
	
	Элементы.ВыбранныеОрганизации.ТекущиеДанные.ИНН = СтруктураДанных.ИНН;
	Элементы.ВыбранныеОрганизации.ТекущиеДанные.КПП = СтруктураДанных.КПП;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеКонтрагентыКонтрагентПриИзменении(Элемент)   
	
	ВыбКонтрагент = Элементы.ВыбранныеКонтрагенты.ТекущиеДанные.Контрагент;
	СтруктураДанных = ИННКППКонтрагента(ВыбКонтрагент);
	
	Элементы.ВыбранныеКонтрагенты.ТекущиеДанные.ИНН = СтруктураДанных.ИНН;
	Элементы.ВыбранныеКонтрагенты.ТекущиеДанные.КПП = СтруктураДанных.КПП; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТиповДокументовМассовоеСозданиеПечатнаяФормаПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	КомандыПечати = ПолучитьКомандыПечатиБезКонтекста(Элементы.ТаблицаТиповДокументовМассовоеСоздание.ТекущиеДанные.ТипСвязанногоДокумента);
	
	Элементы.ТаблицаТиповДокументовМассовоеСозданиеПечатнаяФормаПредставление.СписокВыбора.Очистить();
	
	Для каждого Строка из КомандыПечати цикл
		Элементы.ТаблицаТиповДокументовМассовоеСозданиеПечатнаяФормаПредставление.СписокВыбора.Добавить(Строка.УникальныйИдентификатор, Строка.Представление);
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТиповДокументовМассовоеСозданиеТипСвязанногоДокументаПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	 ПараметрыПоиска = Новый Структура;
	 ПараметрыПоиска.Вставить("ДокРодитель", ЭтаФорма.Элементы.ТаблицаТиповДокументовМассовоеСоздание.ТекущиеДанные.ТипДокумента);
	
	 МассивТипов = ПолучитьМассивРазрешенныхТипов(ПараметрыПоиска, Истина);
	 
	 ЭтаФорма.Элементы.ТаблицаТиповДокументовМассовоеСозданиеТипСвязанногоДокументаПредставление.СписокВыбора.Очистить();
	 
	 Для каждого Тип из МассивТипов цикл
		 
		 ЭтаФорма.Элементы.ТаблицаТиповДокументовМассовоеСозданиеТипСвязанногоДокументаПредставление.СписокВыбора.Добавить(Тип.Значение, Тип.Представление);		 
		 
	 КонецЦикла;
	 
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТиповДокументовМассовоеСозданиеФорматДокументаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Форматы = ПолучитьРазрешенныеФорматы(Элементы.ТаблицаТиповДокументовМассовоеСоздание.ТекущиеДанные.ТипДокумента);
	Элементы.ТаблицаТиповДокументовМассовоеСозданиеФорматДокумента.СписокВыбора.Очистить();	
		
	Для каждого Строка из Форматы цикл
		
		Элементы.ТаблицаТиповДокументовМассовоеСозданиеФорматДокумента.СписокВыбора.Добавить(Строка.Значение, Строка.Представление);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТиповДокументовМассовоеСозданиеТипДокументаПредставлениеПриИзменении(Элемент)
	//Элементы.ТаблицаТиповДокументовМассовоеСоздание.ТекущиеДанные.ТипДокумента = Элементы.ТаблицаТиповДокументовМассовоеСоздание.ТекущиеДанные.ТипДокументаПредставление;
	
	Элементы.ТаблицаТиповДокументовМассовоеСоздание.ТекущиеДанные.ТипДокумента = Элементы.ТаблицаТиповДокументовМассовоеСоздание.ТекущиеДанные.ТипДокументаПредставление;
	ПФЗначение = Элементы.ТаблицаТиповДокументовМассовоеСоздание.ТекущиеДанные.ТипДокумента;
    ЭлементСписка = Элементы.ТаблицаТиповДокументовМассовоеСозданиеТипДокументаПредставление.СписокВыбора.НайтиПоЗначению(ПФЗначение);
	Элементы.ТаблицаТиповДокументовМассовоеСоздание.ТекущиеДанные.ТипДокументаПредставление = ЭлементСписка.Представление;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТиповДокументовМассовоеСозданиеТипСвязанногоДокументаПредставлениеПриИзменении(Элемент)
	
	Элементы.ТаблицаТиповДокументовМассовоеСоздание.ТекущиеДанные.ТипСвязанногоДокумента = Элементы.ТаблицаТиповДокументовМассовоеСоздание.ТекущиеДанные.ТипСвязанногоДокументаПредставление;
	ПФЗначение = Элементы.ТаблицаТиповДокументовМассовоеСоздание.ТекущиеДанные.ТипСвязанногоДокумента;
    ЭлементСписка = Элементы.ТаблицаТиповДокументовМассовоеСозданиеТипСвязанногоДокументаПредставление.СписокВыбора.НайтиПоЗначению(ПФЗначение);
	Элементы.ТаблицаТиповДокументовМассовоеСоздание.ТекущиеДанные.ТипСвязанногоДокументаПредставление = ЭлементСписка.Представление;
	
	//Элементы.ТаблицаТиповДокументовМассовоеСоздание.ТекущиеДанные.ТипСвязанногоДокумента = Элементы.ТаблицаТиповДокументовМассовоеСоздание.ТекущиеДанные.ТипСвязанногоДокументаПредставление;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТиповДокументовМассовоеСозданиеПечатнаяФормаПредставлениеПриИзменении(Элемент)
	
	Элементы.ТаблицаТиповДокументовМассовоеСоздание.ТекущиеДанные.ПечатнаяФорма = Элементы.ТаблицаТиповДокументовМассовоеСоздание.ТекущиеДанные.ПечатнаяФормаПредставление;
	ПФЗначение = Элементы.ТаблицаТиповДокументовМассовоеСоздание.ТекущиеДанные.ПечатнаяФорма;
    ЭлементСписка = Элементы.ТаблицаТиповДокументовМассовоеСозданиеПечатнаяФормаПредставление.СписокВыбора.НайтиПоЗначению(ПФЗначение);
	Элементы.ТаблицаТиповДокументовМассовоеСоздание.ТекущиеДанные.ПечатнаяФормаПредставление = ЭлементСписка.Представление;
	
КонецПроцедуры

#КонецОбласти
